#### Terraform Plan for live environment 📖 `success`

<details><summary>Show Plan</summary>

```

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mersthamcc/accounts-live/runs/run-t9ZJbLSYEPcT2Dcn

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_password.end_of_day_username: Refreshing state... [id=none]
random_password.end_of_day_password: Refreshing state... [id=none]
aws_cloudwatch_event_rule.refresh_tokens_schedule: Refreshing state... [id=live-refresh-tokens-schedule]
aws_dynamodb_table.audit: Refreshing state... [id=live-audit]
aws_cloudwatch_event_rule.match_fee_schedule: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_api_gateway_rest_api.api: Refreshing state... [id=dvzs0cr2fi]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-2:947309733994:certificate/6de880b8-2ee9-430b-aec5-18736dde0fbb]
aws_sqs_queue.transactions: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions]
aws_iam_policy.endpoint_logging_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-standard-lambda-logging]
aws_iam_role.lambda_iam_role: Refreshing state... [id=live-standard-lambda-role]
aws_iam_role.match_fee_lambda_iam_role: Refreshing state... [id=live-match-fee-lambda-role]
aws_iam_role.queue_processor_lambda_iam_role: Refreshing state... [id=live-queue-processor-lambda-role]
aws_iam_role.end_of_day_lambda_iam_role: Refreshing state... [id=live-end-of-day-lambda-role]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=live-standard-lambda-role-20210919210643037700000003]
aws_iam_role_policy_attachment.match_fee_lambda_logs: Refreshing state... [id=live-match-fee-lambda-role-20210919210643041600000004]
aws_iam_role_policy_attachment.queue_processor_lambda_logs: Refreshing state... [id=live-queue-processor-lambda-role-20210919210643138300000005]
aws_iam_role_policy_attachment.end_of_day_lambda_logs: Refreshing state... [id=live-end-of-day-lambda-role-20210919210643033700000002]
aws_lambda_function.match_fee_lambda: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_lambda_function.refresh_token_lambda: Refreshing state... [id=live-refresh-tokens-schedule]
aws_lambda_function.process_transactions_sqs_lambda: Refreshing state... [id=live-transaction-sqs-lambda]
module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-end-of-day-lambda]
time_sleep.wait_60_seconds: Refreshing state... [id=2021-07-20T23:15:10Z]
module.purge_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-purge-unpaid-lambda]
aws_route53_record.api_certificate_validation["api.accounting.mersthamcc.co.uk"]: Refreshing state... [id=Z0577271GSI0V6WKPVVN__fcfa245a7bc80ef625194fe777667542.api.accounting.mersthamcc.co.uk._CNAME]
aws_sqs_queue_policy.process_transactions_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions]
module.sage_callback_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=8zfi9v]
module.sage_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=6w8bcx]
module.end_of_day_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=5jwz1s]
module.purge_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=4epfk4]
aws_acm_certificate_validation.api: Refreshing state... [id=2021-09-19 21:07:13 +0000 UTC]
aws_dynamodb_table_item.test-config: Refreshing state... [id=config|id||live|]
module.sage_callback_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-8zfi9v-GET]
aws_iam_policy.lambda_audit_dynamo_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-audit-lambda-dynamo-policy]
module.sage_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-6w8bcx-GET]
aws_iam_policy.lambda_dynamo_policy: Refreshing state... [id=arn:aws:iam::947309733994:policy/live-standard-lambda-dynamo-policy]
module.end_of_day_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-5jwz1s-POST]
module.purge_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-dvzs0cr2fi-4epfk4-POST]
aws_cloudwatch_log_group.sqs_transactions_log_group: Refreshing state... [id=/aws/lambda/live-transaction-sqs-lambda]
aws_cloudwatch_log_group.match_fee_lambda_log_group: Refreshing state... [id=/aws/lambda/live-match-fee-transfer-schedule]
aws_lambda_event_source_mapping.lambda_sqs_mapping: Refreshing state... [id=d259eabc-f9f3-4153-bc87-578c1e8a3a23]
aws_cloudwatch_event_target.match_fee_schedule_target: Refreshing state... [id=live-match-fee-transfer-schedule-13]
aws_lambda_permission.allow_cloudwatch_to_call_match_fee_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_api_gateway_domain_name.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk]
aws_cloudwatch_log_group.refresh_token_lambda_log_group: Refreshing state... [id=/aws/lambda/live-refresh-tokens-schedule]
aws_lambda_permission.allow_cloudwatch_to_call_refresh_tokens_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.refresh_tokens_schedule_target: Refreshing state... [id=live-refresh-tokens-schedule-11]
aws_iam_role_policy_attachment.queue_processor_lambda_audit_dynamo: Refreshing state... [id=live-queue-processor-lambda-role-2021091921064930940000000a]
module.end_of_day_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-lambda]
module.end_of_day_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.purge_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-purge-unpaid-lambda]
module.purge_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=live-standard-lambda-role-20210919210643417000000008]
aws_iam_role_policy_attachment.end_of_day_lambda_dynamo: Refreshing state... [id=live-end-of-day-lambda-role-20210919210643223400000006]
aws_iam_role_policy_attachment.queue_processor_lambda_dynamo: Refreshing state... [id=live-queue-processor-lambda-role-20210919210643497400000009]
aws_iam_role_policy_attachment.match_fee_lambda_dynamo: Refreshing state... [id=live-match-fee-lambda-role-20210919210643317300000007]
module.end_of_day_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-5jwz1s-POST]
module.purge_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-4epfk4-POST]
aws_route53_record.api: Refreshing state... [id=Z0577271GSI0V6WKPVVN_api.accounting.mersthamcc.co.uk_A]
module.sage_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-lambda]
module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-callback-lambda]
aws_cloudwatch_log_metric_filter.transaction_processing_error_metric: Refreshing state... [id=live-transaction-processing-errors]
aws_cloudwatch_log_metric_filter.transaction_processing_skip_metric: Refreshing state... [id=live-transaction-processing-skips]
aws_cloudwatch_log_metric_filter.transaction_processing_missing_tender_metric: Refreshing state... [id=live-transaction-processing-missing-tender-warning]
aws_cloudwatch_log_metric_filter.transaction_processing_success_metric: Refreshing state... [id=live-transaction-processing-success]
module.sage_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-6w8bcx-GET]
module.sage_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-lambda]
module.sage_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_callback_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-dvzs0cr2fi-8zfi9v-GET]
module.sage_callback_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-callback-lambda]
module.sage_callback_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.deployment: Refreshing state... [id=6rejkx]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-dvzs0cr2fi-live]
aws_api_gateway_base_path_mapping.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_sqs_queue_policy.process_transactions_queue_policy has been changed
  ~ resource "aws_sqs_queue_policy" "process_transactions_queue_policy" {
        id        = "https://sqs.eu-west-2.amazonaws.com/947309733994/live-transactions"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                                "arn:aws:iam::947309733994:role/live-end-of-day-lambda-role",
                              + "arn:aws:iam::947309733994:role/live-match-fee-lambda-role",
                            ]
                        }
                        # (4 unchanged elements hidden)
                    },
                    {
                        Action    = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::947309733994:role/live-queue-processor-lambda-role"
                        }
                        Resource  = "arn:aws:sqs:eu-west-2:947309733994:live-transactions"
                        Sid       = "ReceiveSQS"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.match_fee_schedule_target must be replaced
-/+ resource "aws_cloudwatch_event_target" "match_fee_schedule_target" {
      ~ id             = "live-match-fee-transfer-schedule-13" -> (known after apply)
      ~ target_id      = "13" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.refresh_tokens_schedule_target must be replaced
-/+ resource "aws_cloudwatch_event_target" "refresh_tokens_schedule_target" {
      ~ id             = "live-refresh-tokens-schedule-11" -> (known after apply)
      ~ target_id      = "11" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function.match_fee_lambda will be updated in-place
  ~ resource "aws_lambda_function" "match_fee_lambda" {
        id                             = "live-match-fee-transfer-schedule"
      ~ last_modified                  = "2021-09-29T20:26:33.673+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:947309733994:function:live-match-fee-transfer-schedule:13" -> (known after apply)
      ~ s3_object_version              = "rHNxVZHzbDtdnOSJ5priuNKO194rklxF" -> "X2KrjNcgQEKstM1o22uqdgkw_jcZtEQe"
        tags                           = {}
      ~ version                        = "13" -> (known after apply)
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.process_transactions_sqs_lambda will be updated in-place
  ~ resource "aws_lambda_function" "process_transactions_sqs_lambda" {
        id                             = "live-transaction-sqs-lambda"
      ~ last_modified                  = "2021-09-29T20:26:33.256+0000" -> (known after apply)
      ~ s3_object_version              = "rHNxVZHzbDtdnOSJ5priuNKO194rklxF" -> "X2KrjNcgQEKstM1o22uqdgkw_jcZtEQe"
        tags                           = {}
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.refresh_token_lambda will be updated in-place
  ~ resource "aws_lambda_function" "refresh_token_lambda" {
        id                             = "live-refresh-tokens-schedule"
      ~ last_modified                  = "2021-09-29T20:26:33.683+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:947309733994:function:live-refresh-tokens-schedule:11" -> (known after apply)
      ~ s3_object_version              = "rHNxVZHzbDtdnOSJ5priuNKO194rklxF" -> "X2KrjNcgQEKstM1o22uqdgkw_jcZtEQe"
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-end-of-day-lambda"
      ~ last_modified                  = "2021-09-29T20:26:33.327+0000" -> (known after apply)
      ~ s3_object_version              = "rHNxVZHzbDtdnOSJ5priuNKO194rklxF" -> "X2KrjNcgQEKstM1o22uqdgkw_jcZtEQe"
        tags                           = {}
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.purge_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-purge-unpaid-lambda"
      ~ last_modified                  = "2021-09-29T20:26:33.283+0000" -> (known after apply)
      ~ s3_object_version              = "rHNxVZHzbDtdnOSJ5priuNKO194rklxF" -> "X2KrjNcgQEKstM1o22uqdgkw_jcZtEQe"
        tags                           = {}
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-sage-callback-lambda"
      ~ last_modified                  = "2021-09-29T20:26:33.279+0000" -> (known after apply)
      ~ s3_object_version              = "rHNxVZHzbDtdnOSJ5priuNKO194rklxF" -> "X2KrjNcgQEKstM1o22uqdgkw_jcZtEQe"
        tags                           = {}
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sage_endpoint.aws_lambda_function.endpoint_lambda will be updated in-place
  ~ resource "aws_lambda_function" "endpoint_lambda" {
        id                             = "live-sage-lambda"
      ~ last_modified                  = "2021-09-29T20:26:33.294+0000" -> (known after apply)
      ~ s3_object_version              = "rHNxVZHzbDtdnOSJ5priuNKO194rklxF" -> "X2KrjNcgQEKstM1o22uqdgkw_jcZtEQe"
        tags                           = {}
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 7 to change, 2 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "aws_secret_key" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "aws_access_key" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>